# SetPressLossCalculationServerInfo Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctSettings..::..SetPressLossCalculationServerInfo Method
DuctSettings Class See Also
---
Set the MEPServerInfo of the current pipe pressure loss calculation server.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo serverInfo
)
```

Visual Basic
---
```text
Public Sub SetPressLossCalculationServerInfo ( _
	serverInfo As MEPCalculationServerInfo _
)
```

Visual C++
---
```text
public:
void SetPressLossCalculationServerInfo(
	MEPCalculationServerInfo^ serverInfo
)
```

# ### Parameters
serverInfo
    Type: Autodesk.Revit.DB..::..MEPCalculationServerInfo
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace